### CREATE TEST DATABASE

jira: https://jira.bltelecoms.net/browse/SWITZERLAND-428

In [1]:
import sqlite3

In [2]:
import pandas as pd

In [3]:
conn = sqlite3.connect('etl.db')
print ("Opened database successfully");

Opened database successfully

In [4]:
#  create tables
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50) NOT NULL,
         SALARY         REAL NOT NULL)
         ;''');

conn.execute('''CREATE TABLE VEHICLES
         (ID INT PRIMARY KEY     NOT NULL,
         MAKE           CHAR(20)    NOT NULL,
         CYLINDERS      INT     NOT NULL,
         TRANSMISSION   CHAR(10)    NOT NULL)
         ;''');

print ("Tables created successfully");

# conn.close()

Tables created successfully

In [5]:
# insert records COMPANY table
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (5, 'Dave', 45, 'California', 20010.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (6, 'Bob', 25, 'Texas', 16000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (7, 'Mike', 23, 'Norway', 21000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (8, 'Mark', 55, 'Chicago ', 150000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (9, 'Mark', 45, 'Boston ', 800000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (10, 'Mark', 65, 'Florida ', 120000.00 )");

conn.commit()
print ("COMPANY Records created successfully");

COMPANY Records created successfully

In [6]:
# insert records VEHICLE table
conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (1, 'Ford', 6, 'Auto')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (2, 'VW', 6, 'Manual' )");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (3, 'Peugot', 6, 'Auto')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (4, 'Fiat', 4, 'Auto')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (5, 'Toyota', 4, 'Manual')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (6, 'Toyota', 4, 'Auto')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (7, 'Ford', 6, 'Manual')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (8, 'Toyota', 4, 'Auto')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (9, 'BMW', 6, 'Auto')");

conn.execute("INSERT INTO VEHICLES (ID,MAKE,CYLINDERS,TRANSMISSION) \
      VALUES (10, 'BMW', 6, 'Manual')");

conn.commit()
print ("VEHICLES Records created successfully");

VEHICLES Records created successfully

In [7]:
import sqlite3

conn = sqlite3.connect('etl.db')
print("Opened database successfully");

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print ("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print("Operation done successfully");
conn.close()

Opened database successfully
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

ID =  5
NAME =  Dave
ADDRESS =  California
SALARY =  20010.0

ID =  6
NAME =  Bob
ADDRESS =  Texas
SALARY =  16000.0

ID =  7
NAME =  Mike
ADDRESS =  Norway
SALARY =  21000.0

ID =  8
NAME =  Mark
ADDRESS =  Chicago
SALARY =  150000.0

ID =  9
NAME =  Mark
ADDRESS =  Boston
SALARY =  800000.0

ID =  10
NAME =  Mark
ADDRESS =  Florida
SALARY =  120000.0

Operation done successfully